/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_sort_merge.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gpaeng <gpaeng@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/06/04 13:39:24 by gpaeng            #+#    #+#             */
/*   Updated: 2021/06/04 15:34:18 by gpaeng           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


#include "../../includes/ft_push_swap.h"

def A_to_B(범위의 크기r)
	if r == 1:
		return ;
	스택A의 r개의 원소 중에서 "적절한" 피봇 선택
	for r개의 원소에 대해
		if (스택A의 top) > pivot:
			ra()
		else
